qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L1/stm32l1xx_hal_comp.c
/**
  ******************************************************************************
  * @file    stm32l1xx_hal_comp.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    5-September-2014
  * @brief   COMP HAL module driver.
  *    
  *          This file provides firmware functions to manage the following 
  *          functionalities of the COMP peripheral:
  *           + Initialization and de-initialization functions
  *           + I/O operation functions
  *           + Peripheral Control functions 
  *           + Peripheral State functions
  *         
  @verbatim
================================================================================
          ##### COMP Peripheral features #####
================================================================================
           
  [..]       
      The STM32L1xx device family integrates 2 analog comparators COMP1 and 
      COMP2:
      (#) The non inverting input and inverting input can be set to GPIO pins.
          Refer to "table1. COMP Inputs" below.
          HAL COMP driver configures the Routing Interface (RI) to connect the
          selected I/O pins to comparator input.
          Caution: Comparator COMP1 and ADC cannot be used at the same time as 
          ADC since they share the ADC switch matrix: COMP1 non-inverting 
          input is routed through ADC switch matrix. Except if ADC is intented 
          to measure voltage on COMP1 non-inverting input: it can be performed 
          on ADC channel VCOMP.

      (#) The COMP output is available using HAL_COMP_GetOutputLevel().

      (#) The COMP output can be redirected to embedded timers (TIM2, TIM3, 
          TIM4, TIM10).
          COMP output cannot be redirected to any I/O pin.
          Refer to "table 2. COMP Outputs redirection to embedded timers" below.

      (#) The comparators COMP1 and COMP2 can be combined in window mode. 
          In this mode, COMP2 non inverting input is used as common 
          non-inverting input.
  
      (#) The 2 comparators have interrupt capability with wake-up
          from Sleep and Stop modes (through the EXTI controller):
          (++) COMP1 is internally connected to EXTI Line 21
          (++) COMP2 is internally connected to EXTI Line 22

          From the corresponding IRQ handler, the right interrupt source can be
          retrieved with macro __HAL_COMP_EXTI_GET_FLAG(). Possible values are: 
          (++) COMP_EXTI_LINE_COMP1_EVENT
          (++) COMP_EXTI_LINE_COMP2_EVENT
  
      (#) The comparators also offer the possibility to ouput the voltage 
          reference (VrefInt), used on inverting inputs, on I/O pin through 
          a buffer. To use it, refer to macro "__HAL_VREFINT_OUT_ENABLE()".

            
[..] Table 1. COMP Inputs for the STM32L1xx devices
 +----------------------------------------------------------------------+
 |                 |                                |  COMP1  |  COMP2  |
 |-----------------|--------------------------------|---------|---------|
 |                 | 1/4 VREFINT                    |   --    |   OK    |
 |                 | 1/2 VREFINT                    |   --    |   OK    |
 |                 | 3/4 VREFINT                    |   --    |   OK    |
 | Inverting       | VREFINT                        |   OK    |   OK    |
 | input           | DAC Ch1 OUT (PA4)              |   --    |   OK    |
 |                 | DAC Ch2 OUT (PA5)              |   --    |   OK    |
 |                 | IO: PB3                        |   --    |   OK    |
 |-----------------|--------------------------------|---------|---------|
 |                 | IO:                            |         |         |
 |                 |   PB4, 5, 6*, 7*               |   ---   |   OK    |
 | Non-inverting   |   PA0*, 1*, 2*, 3*, 4, 5, 6, 7 |   OK    |   ---   |
 | input           |   PB0, 1, 12, 13, 14, 15       |   OK    |   ---   |
 |                 |   PC0, 1, 2, 3, 4, 5           |   OK    |   ---   |
 |                 |   PE7, 8, 9, 10                |   OK    |   ---   |
 |                 |   PF6, 7, 8, 9, 10             |   OK    |   ---   |
 |                 | OPAMP1 output                  |   OK    |   ---   |
 |                 | OPAMP2 output                  |   OK    |   ---   |
 |                 | OPAMP3 output**                |   OK    |   ---   |
 +----------------------------------------------------------------------+
 *: Available on devices category Cat.3, Cat.4, Cat.5 only. 
 **: Available on devices category Cat.4 only. 

 [..] Table 2. COMP Outputs redirection to embedded timers
 +-----------------------------------+     
 |      COMP1      |      COMP2      |
 |-----------------|-----------------|
 |                 |  TIM2 IC4       |
 |                 |  TIM2 OCREF CLR |
 | (no redirection |  TIM3 IC4       |
 |   to timers)    |  TIM3 OCREF CLR |
 |                 |  TIM4 IC4       |
 |                 |  TIM4 OCREF CLR |
 |                 |  TIM10 IC1      |
 +-----------------------------------+


            ##### How to use this driver #####
================================================================================
  [..]
      This driver provides functions to configure and program the Comparators of all STM32L1xx devices.

      To use the comparator, perform the following steps:
  
      (#)  Initialize the COMP low level resources by implementing the HAL_COMP_MspInit().
      (++) Configure the comparator input I/O pin using HAL_GPIO_Init():
           - For all inputs: I/O pin in analog mode (Schmitt trigger disabled)
           - Possible alternate configuration, for non-inverting inputs of comparator 2: I/O pin in floating mode (Schmitt trigger enabled).
           It is recommended to use analog configuration to avoid any overconsumption around VDD/2.
      (++) Enable COMP Peripheral clock using macro __COMP_CLK_ENABLE()
      (++) If required enable the COMP interrupt (EXTI line Interrupt): enable
           the comparator interrupt vector using HAL_NVIC_EnableIRQ(COMP_IRQn)
           and HAL_NVIC_SetPriority(COMP_IRQn, xxx, xxx) functions.
  
      (#) Configure the comparator using HAL_COMP_Init() function:
      (++) Select the inverting input (COMP2 only)
      (++) Select the non-inverting input
      (++) Select the output redirection to timers (COMP2 only)
      (++) Select the speed mode (COMP2 only)
      (++) Select the window mode (related to COMP1 and COMP2, but selected 
           by COMP2 only)
      (++) Select the pull-up/down resistors on non-inverting input (COMP1 only)

